In [44]:
'''复习'''
import numpy as np
a = np.arange(12).reshape(3,4)
np.sum(a)

66

In [48]:
np.sum(a,axis=0) #

array([12, 15, 18, 21])

In [ ]:
b = np.arange(24).reshape(2,3,4)
np.sum(b)
np.sum(b,axis=0)
np.sum(b,axis=1)
np.sum(b,axis=2)
np.sum(b,axis=(0,1)) #先按0加，加完后再按1加，1就相当于加完后的按0加

In [1]:
'''
学习网站:https://pandas.pydata.org/
一维数据结构:Series
二维数据结构:DataFrame
DataFrame由Series组成
增删改查汇总分组连接合并

'''

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
plt.show()

'''创建一维数组'''
apples = pd.Series([3,2,1,4]) #第一列为索引,第二列为数据
#数据可以有不同类型，但不建议这样用
type(apples)
apples.values
type(apples.values)
apples.index
type(apples.index)
#pd.Series(data, index, dtype, ...) 索引名必须与数据相匹配，不能多也不能少
banana = pd.Series([1,2,2,0], index=['a','b','c','d']) #index专门用于行
banana = pd.Series([1,2,2,0], index=['a','b','b','d']) #可以有重复的名字
banana = pd.Series(10, index=['a','b','c','d']) #重复的值可快速赋索引名
banana['b'] #所有的b都索引出
data = {'a':1, 'b':2, 'c':2, 'd':0}
data = {'a':1, 'b':2, 'c':2, 'b':0} #字典的key不能重复,取最后一个(最近更新的值)
orange = pd.Series(data)

'''索引一维数组'''
data = {'a':1, 'b':2, 'c':2, 'd':0}
orange = pd.Series(data)
orange['a']
orange['a':'c'] #顾头也顾尾
orange[0:3] #顾头不顾尾
a = [True, False, True, False]
orange[a] #或orange[[True, False, True, False]]
orange[orange>=2]
orange[['a','b']] #花式下标，标签为数组或列表
orange[[1,3]] #注意中括号

'''创建二维数组'''
#行列是可变的
#pd.DataFrame(data, index, columns, dtype, ...) index为行索引,columns为列索引
apple = [1,2,3,4,5]
df = pd.DataFrame(apple)

banana = [[1,2,3],
          [4,5,6],
          [7,8,9]]
df = pd.DataFrame(banana)
df = pd.DataFrame(banana, columns=['Ha','Wa','Yi']) #给列取名
df = pd.DataFrame(banana, index=['Ha','Wa','Yi']) #给行取名
df = pd.DataFrame(banana, index=['Ha','Wa','Yi'], columns=['Ha','Wa','Yi']) #给行列都取名

data = {'apple':[1,2,3,4],
        'banana':[5,6,7,8],
        'orange':[9,10,11,12]}
df = pd.DataFrame(data)
df = pd.DataFrame(data, index=['very good','good','just so so','bad'])

#会出现NaN
#data = {'apple':pd.Series([1,2,3,4]),
#        'banana':pd.Series([5,6,7,8]),
#        'orange':pd.Series([9,10,11,12])}
#df = pd.DataFrame(data)
#df = pd.DataFrame(data, index=['very good','good','just so so','bad'])

data = {'apple':pd.Series([1,2,3,4]),
        'banana':pd.Series([5,6,7,8]),
        'orange':pd.Series([9,10,11,12])}
df = pd.DataFrame(data)
df.index = ['very good','good','just so so','bad']


'''索引二维数组'''
#访问列，只能用名字,如果取了名字,就只能用自己取的名字;如果没取名字,就用0,1,2当作名字
banana = [[1,2,3],
          [4,5,6],
          [7,8,9]]
df = pd.DataFrame(banana)
df[0] #取列
type(df[0])
df[[0,2]] #0和2相当于列名
df[0:3] #行

banana = [[1,2,3],
          [4,5,6],
          [7,8,9]]
df = pd.DataFrame(banana)
df = pd.DataFrame(banana, columns=['Ha','Wa','Yi']) #给列取名
df[0] #报错,因为自己定义了列名,位置的索引就不能使用
df['Ha']
type(df['Ha'])

SyntaxError: invalid syntax (<ipython-input-1-8f69dd596d5b>, line 13)

In [20]:
import numpy as np
import pandas as pd

data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,0]
}
df = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
df

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1
Lily         0        1        2
David        1        0        3

# 通过query方法访问dataframe行

In [19]:
df.query('apples>1')

        apples  bandas  oranges
June         3       1        0
Robert       2       2        1

In [22]:
df.query('apples > 1' and 'bananas > 1')

        apples  bananas  oranges
Robert       2        2        1

# 通过head和tail方法访问dataframe行
- head(n),省略n返回前5行
- tail(n),省略n返回后5行

In [23]:
df.head(2)

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1

# 使用dataframe存取器loc[]
## DataFrame.loc[n,m]
- n可是单个行标签，多行标签数组（或列表），行标签切片，布尔数组
- m可是单个列标签，多列标签数组（或列表），列标签切片，布尔数组

In [25]:
df.loc['David','apples']  #David 行 apples 列

1

In [26]:
df.loc[['David','Robert'],'apples'] #按顺序输出

David     1
Robert    2
Name: apples, dtype: int64

In [30]:
b = [True,False,True,False]
df.loc[b,'apples']

June    3
Lily    0
Name: apples, dtype: int64

In [29]:
df.loc[b,'apples':]

      apples  bananas  oranges
June       3        1        0
Lily       0        1        2

# 使用dataframe存取器iloc[]
## DataFrame.iloc[n,m]
- n可是单个行位置，多行位置数组（或列表），行位置切片，布尔数组
- m可是单个列位置，多列位置数组（或列表），列位置切片，布尔数组

In [33]:
df.iloc[3,0]

1

In [34]:
df.iloc[[3,1],0]

David     1
Robert    2
Name: apples, dtype: int64

In [36]:
b = [True,False,True,False]
df.iloc[b,0]

June    3
Lily    0
Name: apples, dtype: int64

In [37]:
df.iloc[:,0:2]

        apples  bananas
June         3        1
Robert       2        2
Lily         0        1
David        1        0

In [40]:
df.iloc[1:3,0:2]

        apples  bananas
Robert       2        2
Lily         0        1

# 使用DataFrame 存取器at[]和iat[]

df.at[n,m]
df.iat[idx_n,idx_m]

In [49]:
df.at['Robert','apples']

2

In [50]:
df.iat[1,0]

2

# dataframe 添加行和删除
- append方法
- drop方法
drop(labels = None)

In [56]:
data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,0]
}
df1 = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
df1

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1
Lily         0        1        2
David        1        0        3

In [62]:
L = [[1,3,1],[2,4,1]]
df2 = pd.DataFrame(L,columns = ['apples','oranges','bananas'],index = ['Robert','Tom'])
df2

        apples  oranges  bananas
Robert       1        3        1
Tom          2        4        1

In [63]:
df3 = df1.append(df2)
df3

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1
Lily         0        1        2
David        1        0        3
Robert       1        1        3
Tom          2        1        4

In [65]:
df4 = df3.drop('Robert')  #会删除同名的行
df4

       apples  bananas  oranges
June        3        1        0
Lily        0        1        2
David       1        0        3
Tom         2        1        4

# dataframe 添加和删除列
添加：直接加
删除：
- drop
- del
- pop

In [82]:
data = {
    'apples' : [3,2,0,1]
}
df = pd.DataFrame(data)
df

   apples
0       3
1       2
2       0
3       1

In [83]:
df['bananas'] = pd.Series([1,2,0,1])
df

   apples  bananas
0       3        1
1       2        2
2       0        0
3       1        1

In [84]:
del df['bananas']
df

   apples
0       3
1       2
2       0
3       1

In [85]:
df.pop('apples')  #删除选择列兵返回删除列

0    3
1    2
2    0
3    1
Name: apples, dtype: int64

#  更改标签
- rename  #用字典的形式

In [86]:
data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,0]
}
df = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
df

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1
Lily         0        1        2
David        1        0        3

In [88]:
df.rename({'Lily':'莉莉'})  # 改行标签

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1
莉莉           0        1        2
David        1        0        3

In [91]:
df.rename(columns = {'apples':'苹果'})  # 改列标签  {'oranges':'橙子'}

        苹果  bananas  oranges
June     3        1        0
Robert   2        2        1
Lily     0        1        2
David    1        0        3

# index

In [53]:
label = pd.Index(['a','b','c','d','e'])
s = pd.Series(np.arange(5),index = label)
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

# reindex

In [96]:
s1 = s.reindex(['a','b','c'])
s1

a    0
b    1
c    2
dtype: int32

In [98]:
s2 = s.reindex(['a','b','c','d','e','f'])
s2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    NaN
dtype: float64

# MultiIndex  多级索引
- pandas.MultiIndex.from_arrays, 从数组创建
- pandas.MultiIndex.from_product, 从笛卡尔积创建
- pandas.MultiIndex.from_tuples, 从元祖创建
- pandas.MultiIndex.from_frame, 另外DataFrame创建

In [103]:
keys = [('June','apples'),('June','oranges'),('June','bananas'),
        ('Robert','apples'),('Robert','oranges'),('Robert','bananas'),
        ('Lily','apples'),('Lily','oranges'),('Lily','bananas'),
        ('David','apples'),('David','oranges'),('David','bananas')
       ]

In [104]:
index = pd.MultiIndex.from_tuples(keys,names = ['names','fruits'])
index

MultiIndex(levels=[['David', 'June', 'Lily', 'Robert'], ['apples', 'bananas', 'oranges']],
           labels=[[1, 1, 1, 3, 3, 3, 2, 2, 2, 0, 0, 0], [0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1]],
           names=['names', 'fruits'])

In [108]:
data = [3,0,1,
       2,1,2,
       0,2,1,
       1,3,0]
s = pd.Series(data,index = index)
s

names   fruits
June    apples     3
        oranges    0
        bananas    1
Robert  apples     2
        oranges    1
        bananas    2
Lily    apples     0
        oranges    2
        bananas    1
David   apples     1
        oranges    3
        bananas    0
dtype: int64

## 多级索引行列转换
- unstack  二维
- stack  一维

In [109]:
s.unstack()

fruits  apples  bananas  oranges
names
David        1        0        3
June         3        1        0
Lily         0        1        2
Robert       2        2        1

In [111]:
data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,0]
}
df = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
df

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1
Lily         0        1        2
David        1        0        3

In [113]:
df.stack()  #一维

June    apples     3
        bananas    1
        oranges    0
Robert  apples     2
        bananas    2
        oranges    1
Lily    apples     0
        bananas    1
        oranges    2
David   apples     1
        bananas    0
        oranges    3
dtype: int64

# 数据的读写操作

# 读写Excel 文件
- pandas.read_excel(io,sheet_name = 0,header = 0, index_col = None, skiprows = None, skipfooter = 0)
io:Excel文件

In [120]:
import pandas as pd
file_path = r'D:\用户目录\我的文档\Tencent Files\1521131720\FileRecv\data_pandas(20191021)\全国总人口数据.xls'
df1 = pd.read_excel(file_path)
df1

,数据库：年度数据,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,时间：最近10年,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,指标,2018年,2017年,2016年,2015年,2014年,2013年,2012年,2011年,2010年,2009年
2,年末总人口(万人),139538,139008,138271,137462,136782,136072,135404,134735,134091,133450
3,男性人口(万人),71351,71137,70815,70414,70079,69728,69395,69068,68748,68647
4,女性人口(万人),68187,67871,67456,67048,66703,66344,66009,65667,65343,64803
5,城镇人口(万人),83137,81347,79298,77116,74916,73111,71182,69079,66978,64512
6,乡村人口(万人),56401,57661,58973,60346,61866,62961,64222,65656,67113,68938
7,注：1981年及以前人口数据为户籍统计数；1982、1990、2000、2010年数据为当年...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,数据来源：国家统计局,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [123]:
df2 = pd.read_excel(file_path,header = 2)
df2

,指标,2018年,2017年,2016年,2015年,2014年,2013年,2012年,2011年,2010年,2009年
0,年末总人口(万人),139538.0,139008.0,138271.0,137462.0,136782.0,136072.0,135404.0,134735.0,134091.0,133450.0
1,男性人口(万人),71351.0,71137.0,70815.0,70414.0,70079.0,69728.0,69395.0,69068.0,68748.0,68647.0
2,女性人口(万人),68187.0,67871.0,67456.0,67048.0,66703.0,66344.0,66009.0,65667.0,65343.0,64803.0
3,城镇人口(万人),83137.0,81347.0,79298.0,77116.0,74916.0,73111.0,71182.0,69079.0,66978.0,64512.0
4,乡村人口(万人),56401.0,57661.0,58973.0,60346.0,61866.0,62961.0,64222.0,65656.0,67113.0,68938.0
5,注：1981年及以前人口数据为户籍统计数；1982、1990、2000、2010年数据为当年...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,数据来源：国家统计局,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## 写csv
列名 ：header

In [ ]:
import numpy as np
import pandas as pd

data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,0]
}
df = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
df.to_excel(r'C:\Users\Administrator'+'\水果2.csv')

# 读写CSV

In [15]:
#编码是gbk,engine 改为python，前后
df3 = pd.read_csv(r'D:\用户目录\我的文档\Tencent Files\1521131720\FileRecv\data_pandas(20191021)'+'\全国总人口10年数据.csv',engine='python',skiprows = 2,skipfooter = 2)
df3

,指标,2018年,2017年,2016年,2015年,2014年,2013年,2012年,2011年,2010年,2009年
0,年末总人口(万人),139538,139008,138271,137462,136782,136072,135404,134735,134091,133450
1,男性人口(万人),71351,71137,70815,70414,70079,69728,69395,69068,68748,68647
2,女性人口(万人),68187,67871,67456,67048,66703,66344,66009,65667,65343,64803
3,城镇人口(万人),83137,81347,79298,77116,74916,73111,71182,69079,66978,64512
4,乡村人口(万人),56401,57661,58973,60346,61866,62961,64222,65656,67113,68938

In [17]:
df4 = pd.read_csv(r'D:\用户目录\我的文档\Tencent Files\1521131720\FileRecv\data_pandas(20191021)'+'\pandas_tutorial_read.csv',sep = '')
df4

ValueError: only single character unicode strings can be converted to Py_UCS4, got length 0

# 写数据到csv

In [20]:
import numpy as np
import pandas as pd

data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,0]
}
df = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
#中文会乱码，用记事本改成utf-8编码
df.to_csv(r'C:\Users\Administrator'+'\水果2.csv',header = ['苹果','橘子','香蕉'])

# 算术运算
- 行名列名相同才能相加 实现点对点
- 不相同结果为NAN
- mul:点对点的乘法，不是矩阵相乘

# df.fillna(a) 将NAN换成想要的数

# <font color = 'red'>（考）# seris 和DataFrame 怎么加？</font>

# 描述性统计
- count()
- sum()
- mean()
- std()
- min()\max()
- prod() 指定范围所有值的乘积
- cumsum() 计算累加值
- cumprod() 计算累乘积值

In [44]:
import numpy as np
import pandas as pd

data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,np.nan]
}
df5 = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
df5

        apples  oranges  bananas
June         3        0      1.0
Robert       2        1      2.0
Lily         0        2      1.0
David        1        3      NaN

In [43]:
import numpy as np
import pandas as pd

data = {
    'apples':[3,2,0,1],
    'oranges':[0,1,2,3],
    'bananas':[1,2,1,np.nan]
}
df5 = pd.DataFrame(data,index = ['June','Robert','Lily','David'])
df5.count()  # 每一列有多少条非NAN数据  默认axis = 0（列）
df5.sum(skipna = False)     # 竖向求和  axis = 0/1 ; skipna = False 没有NAN
df5.prod()
df5.cumsum()  # 竖向累加 axis = 1,横向
df5.cumprod()

        apples  oranges  bananas
June       3.0      0.0      1.0
Robert     6.0      0.0      2.0
Lily       0.0      0.0      2.0
David      0.0      0.0      NaN

In [45]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, June to David
Data columns (total 3 columns):
apples     4 non-null int64
oranges    4 non-null int64
bananas    3 non-null float64
dtypes: float64(1), int64(2)
memory usage: 128.0+ bytes

In [46]:
df.describe()

         apples   oranges   bananas
count  4.000000  4.000000  4.000000
mean   1.500000  1.500000  1.000000
std    1.290994  1.290994  0.816497
min    0.000000  0.000000  0.000000
25%    0.750000  0.750000  0.750000
50%    1.500000  1.500000  1.000000
75%    2.250000  2.250000  1.250000
max    3.000000  3.000000  2.000000

# 函数应用
- apply seris 和DataFrame 都可用
- applymap 仅适用dataframe
- map 仅适用seris

In [48]:
def add(x):
    return x + 4000
df5.apply(add)

        apples  oranges  bananas
June      4003     4000   4001.0
Robert    4002     4001   4002.0
Lily      4000     4002   4001.0
David     4001     4003      NaN

In [51]:
df5.apply(lambda x:x.max()-x.min(),axis = 1)  # axis = 0求每一列

June      3.0
Robert    1.0
Lily      2.0
David     2.0
dtype: float64

In [54]:
s.map(lambda x:x*10)

a     0
b    10
c    20
d    30
e    40
dtype: int64

# 排序
- sort_index():行标签和列标签
- sort_values():值
ascending = True 升序

In [61]:
s = pd.Series([8,7,3],index = list('bac'))
s.sort_index()
s.sort_values()
help(s.sort_values,ascending = False)

TypeError: __call__() got an unexpected keyword argument 'ascending'